Repository: ls1intum/BinarySpectrum
Catalog: EducationalGame/EducationalGame/Others/Localizable.xcstrings
Source language: en
Languages: de, pt_br

source: Sound waves and frames
de: Schallwellen und Frames
pt_br: Ondas sonoras e quadros

source: Start Playing
de: Starte Spiel
pt_br: Começar a Jogar

source: Starting from the right: the first spot is worth 1, then 2, then 4, then 8, and so on.
de: Von rechts beginnend: Die erste Stelle ist 1 wert, dann 2, dann 4, dann 8 und so weiter.
pt_br: Começando pela direita: o primeiro lugar vale 1, depois 2, depois 4, depois 8, e assim por diante.

source: Subtract this value
de: Diesen Wert subtrahieren
pt_br: Subtrair este valor

source: Switch the digits to represent your birthdate and get your binary armband. Remember: each position represents a power of 2: 1, 2, 4, 8, 16.
de: Wechsle die Ziffern, um dein Geburtsdatum darzustellen und dein binäres Armband zu erhalten. Denk daran: Jede Position steht für eine Potenz von 2: 1, 2, 4, 8, 16.
pt_br: Alterne os dígitos para representar sua data de nascimento e obter sua pulseira binária. Lembre-se: cada posição representa uma potência de 2: 1, 2, 4, 8, 16.

source: Tap the circles to toggle between 0 and 1. Your goal is to represent %lld in binary.
de: Tippe auf die Kreise, um zwischen 0 und 1 zu wechseln. Dein Ziel ist es, %lld binär darzustellen.
pt_br: Toque nos círculos para alternar entre 0 e 1. Seu objetivo é representar %lld em binário.

source: Target
de: Ziel
pt_br: Alvo

source: Target Color
de: Zielfarbe
pt_br: Cor Alvo

source: Test your understanding of binary concepts. Select the answer you think is correct, no problem if is not correct.
de: Teste dein Verständnis von Binärkonzepten. Wähle die Antwort, die du für richtig hältst, kein Problem, wenn sie nicht korrekt ist.
pt_br: Teste sua compreensão dos conceitos binários. Selecione a resposta que você acha que está correta, sem problema se não estiver correta.

source: Test your understanding of digital pictures. Select the answer you think is correct, no problem if is not correct.
de: Teste dein Verständnis von digitalen Bildern. Wähle die Antwort, die du für richtig hältst, kein Problem, wenn sie nicht korrekt ist.
pt_br: Teste sua compreensão de imagens digitais. Selecione a resposta que você acha que está correta, sem problema se não estiver correta.

source: Test your understanding of how the RGB color model works. Select the answer you think is correct, no problem if is not correct.
de: Teste dein Verständnis davon, wie das RGB-Farbmodell funktioniert. Wähle die Antwort, die du für richtig hältst, kein Problem, wenn sie nicht korrekt ist.
pt_br: Teste sua compreensão de como o modelo de cor RGB funciona. Selecione a resposta que você acha que está correta, sem problema se não estiver correta.

source: The color's brightness
de: Die Helligkeit der Farbe
pt_br: O brilho da cor

source: The color's temperature
de: Die Temperatur der Farbe
pt_br: A temperatura da cor

source: The first two characters show red, the middle two show green, and the last two show blue.
de: Die ersten beiden Zeichen zeigen Rot, die mittleren beiden zeigen Grün und die letzten beiden zeigen Blau.
pt_br: Os dois primeiros caracteres mostram vermelho, os dois do meio mostram verde e os dois últimos mostram azul.

source: The image becomes blurrier
de: Das Bild wird unschärfer
pt_br: A imagem fica mais borrada

source: The image becomes smaller and simpler
de: Das Bild wird kleiner und einfacher
pt_br: A imagem fica menor e mais simples

source: The image can show more detail
de: Das Bild kann mehr Details zeigen
pt_br: A imagem pode mostrar mais detalhes

source: The image disappears
de: Das Bild verschwindet
pt_br: A imagem desaparece

source: The light and dark pearls will show your birthday as a secret binary pattern!
de: Die hellen und dunklen Perlen zeigen deinen Geburtstag als geheimes Binärmuster!
pt_br: As pérolas claras e escuras mostrarão seu aniversário como um padrão binário secreto!

source: These two digits might look simple, but they're powerful enough to create entire digital worlds.
de: Diese beiden Ziffern mögen einfach aussehen, aber sie sind mächtig genug, um ganze digitale Welten zu erschaffen.
pt_br: Esses dois dígitos podem parecer simples, mas são poderosos o suficiente para criar mundos digitais inteiros.

source: They can also make things see-through using something called opacity.
de: Sie können Dinge auch durchsichtig machen, indem sie etwas verwenden, das Deckkraft genannt wird.
pt_br: Eles também podem tornar as coisas transparentes usando algo chamado opacidade.

source: This is called compression - it's like digital magic that saves space!
de: Das nennt man Kompression - es ist wie digitale Magie, die Platz spart!
pt_br: Isso é chamado de compressão - é como mágica digital que economiza espaço!

source: This is called opacity. It determines how see-through something is.
de: Das nennt man Deckkraft. Sie bestimmt, wie durchsichtig etwas ist.
pt_br: Isso é chamado de opacidade. Ela determina o quão transparente algo é.

source: This is how computers represent your image in binary: %@ Each 1 represents a black pixel, and each 0 represents a white pixel.
de: So stellen Computer dein Bild binär dar: %@ Jede 1 stellt ein schwarzes Pixel dar und jede 0 ein weißes Pixel.
pt_br: É assim que os computadores representam sua imagem em binário: %@ Cada 1 representa um pixel preto e cada 0 representa um pixel branco.

source: To change all pixels to black
de: Alle Pixel auf Schwarz ändern
pt_br: Para alterar todos os pixels para preto

source: To convert binary to decimal, multiply each bit by its power of 2 and add the results.
de: Um Binär in Dezimal umzuwandeln, multipliziere jedes Bit mit seiner Potenz von 2 und addiere die Ergebnisse.
pt_br: Para converter binário para decimal, multiplique cada bit por sua potência de 2 e some os resultados.

source: To convert decimal to binary, find the largest power of 2 that fits, subtract it, and repeat.
de: Um Dezimal in Binär umzuwandeln, finde die größte Potenz von 2, die passt, ziehe sie ab und wiederhole den Vorgang.
pt_br: Para converter decimal para binário, encontre a maior potência de 2 que cabe, subtraia-a e repita.

source: To create colorful images on a screen, computers must first represent each pixel's color using what two key concepts?
de: Um farbige Bilder auf einem Bildschirm zu erstellen, müssen Computer zuerst die Farbe jedes Pixels mit welchen zwei Schlüsselkonzepten darstellen?
pt_br: Para criar imagens coloridas em uma tela, os computadores devem primeiro representar a cor de cada pixel usando quais dois conceitos-chave?

source: To delete unnecessary images
de: Um unnötige Bilder zu löschen
pt_br: Para excluir imagens desnecessárias

source: To make it look more colorful
de: Um es farbiger aussehen zu lassen
pt_br: Para torná-lo mais colorido

source: To make the file size smaller
de: Um die Dateigröße zu verkleinern
pt_br: Para tornar o tamanho do arquivo menor

source: Today, I'll show you how we use binary - the special language computers understand.
de: Heute zeige ich dir, wie wir Binärcode verwenden - die besondere Sprache, die Computer verstehen.
pt_br: Hoje, vou mostrar como usamos o sistema binário - a linguagem especial que os computadores entendem.

source: Transform code into art by change the color of the pixels to black where there is a one.
de: Verwandle Code in Kunst, indem du die Farbe der Pixel an den Stellen, an denen eine 1 steht, auf Schwarz änderst.
pt_br: Transforme o código em arte alterando a cor dos pixels para preto onde há um um.

source: Try Again
de: Erneut versuchen
pt_br: Tente novamente

source: Try creating a simple image using an 8×8 grid. Think of each cell as a pixel that can be either on or off. Name your creation at the end.
de: Versuche, ein einfaches Bild mit einer 8×8-Raster zu erstellen. Denke an jede Zelle als ein Pixel, das entweder an oder aus sein kann. Nenne deine Kreation am Ende.
pt_br: Tente criar uma imagem simples usando uma grade 8×8. Pense em cada célula como um pixel que pode estar ligado ou desligado. Nomeie sua criação no final.

source: Understanding digital color is essential for design, game development, web development, and digital art.
de: Das Verständnis von digitaler Farbe ist für Design, Spieleentwicklung, Webentwicklung und digitale Kunst unerlässlich.
pt_br: Entender a cor digital é essencial para design, desenvolvimento de jogos, desenvolvimento web e arte digital.

source: Update your profile information
de: Aktualisiere deine Profilinformationen
pt_br: Atualize suas informações de perfil

source: User Interfaces Digital Artwork Animations Coding with CSS
de: Benutzeroberflächen Digitale Kunstwerke Animationen Codierung mit CSS
pt_br: Interfaces de usuário Arte digital Animações Codificação com CSS

source: View not found
de: Ansicht nicht gefunden
pt_br: Visualização não encontrada

source: W2B4W2 means: 2 white pixels 4 black pixels 2 white pixels
de: W2B4W2 bedeutet: 2 weiße Pixel 4 schwarze Pixel 2 weiße Pixel
pt_br: W2B4W2 significa: 2 pixels brancos 4 pixels pretos 2 pixels brancos

source: We're going to create your personal Binary Armband using your birthday!
de: Wir werden dein persönliches Binäres Armband mit deinem Geburtstag erstellen!
pt_br: Vamos criar sua Pulseira Binária pessoal usando seu aniversário!

source: Welcome to %@
de: Willkommen bei %@
pt_br: Bem-vindo(a) ao %@

source: Welcome to %@, a mini game about binary numbers. Touch the arrows on the bottom and see what Alex has to say.
de: Willkommen zu %@, einem Minispiel über Binärzahlen. Tippe auf die Pfeile unten und höre, was Alex zu sagen hat.
pt_br: Bem-vindo(a) ao %@, um mini-game sobre números binários. Toque nas setas na parte inferior e veja o que o Alex tem a dizer.

source: Welcome to %@, a mini game about digital colors. Touch the arrows on the bottom and see what Iris has to say.
de: Willkommen zu %@, einem Minispiel über digitale Farben. Tippe auf die Pfeile unten und höre, was Iris zu sagen hat.
pt_br: Bem-vindo(a) ao %@, um mini-game sobre cores digitais. Toque nas setas na parte inferior e veja o que a Iris tem a dizer.

source: Welcome to %@, a mini game about pixel art. Touch the arrows on the bottom and see what Pixie has to say.
de: Willkommen zu %@, einem Minispiel über Pixelkunst. Tippe auf die Pfeile unten und höre, was Pixie zu sagen hat.
pt_br: Bem-vindo(a) ao %@, um mini-game sobre arte de pixel. Toque nas setas na parte inferior e veja o que a Pixie tem a dizer.

source: Welcome to %@! Choose a mini-game to start learning about computer science concepts in a fun way.
de: Willkommen zu %@! Wähle ein Minispiel, um auf spielerische Weise mit Informatikkonzepten zu lernen.
pt_br: Bem-vindo(a) ao %@! Escolha um mini-game para começar a aprender sobre conceitos de ciência da computação de forma divertida.

source: Welcome to the game! This informational popup provides context about your current screen.
de: Willkommen zum Spiel! Dieses Informationsfenster stellt den Kontext deines aktuellen Bildschirms dar.
pt_br: Bem-vindo(a) ao jogo! Este pop-up informativo fornece contexto sobre sua tela atual.

source: Welcome,
de: Willkommen,
pt_br: Bem-vindo(a),

source: Welcome!
de: Willkommen!
pt_br: Bem-vindo(a)!

source: What color do you see when red, green, and blue are all at their maximum values on a screen?
de: Welche Farbe siehst du, wenn Rot, Grün und Blau auf einem Bildschirm auf ihren maximalen Werten sind?
pt_br: Qual cor você vê quando o vermelho, o verde e o azul estão em seus valores máximos em uma tela?

source: What does a '0' mean in a binary number?
de: Was bedeutet eine '0' in einer Binärzahl?
pt_br: O que significa um '0' em um número binário?

source: What does opacity control when working with digital colors?
de: Was kontrolliert die Deckkraft beim Arbeiten mit digitalen Farben?
pt_br: O que a opacidade controla ao trabalhar com cores digitais?

source: What happens when we increase the number of pixels in an image?
de: Was passiert, wenn wir die Anzahl der Pixel in einem Bild erhöhen?
pt_br: O que acontece quando aumentamos o número de pixels em uma imagem?

source: What is one reason we might want to compress an image?
de: Warum möchten wir ein Bild komprimieren?
pt_br: Por que podemos querer comprimir uma imagem?

source: When red, green, and blue light are all at full strength, they combine to create white!
de: Wenn Rot, Grün und Blau auf voller Stärke sind, kombinieren sie zu Weiß!
pt_br: Quando o vermelho, o verde e o azul estão em sua intensidade máxima, eles se combinam para criar branco!

source: Which sequence correctly shows how binary place values grow?
de: Welche Sequenz zeigt korrekt, wie Binärstellenwerte wachsen?
pt_br: Qual sequência mostra corretamente como os valores de posição binária crescem?

source: White
de: Weiß
pt_br: Branco

source: Why do computers use binary code instead of regular numbers?
de: Warum verwenden Computer Binärcode statt reguläre Zahlen?
pt_br: Por que os computadores usam código binário em vez de números regulares?

source: Words and sentences
de: Wörter und Sätze
pt_br: Palavras e frases

source: Write the binary code for this image. Remember: 1 for black pixels, 0 for white pixels.
de: Schreibe den Binärcode für dieses Bild. Denke daran: 1 für schwarze Pixel, 0 für weiße Pixel.
pt_br: Escreva o código binário para esta imagem. Lembre-se: 1 para pixels pretos, 0 para pixels brancos.

source: You can represent dates in binary! Your armband shows your birthdate in binary form.
de: Du kannst Daten im Binärsystem darstellen! Dein Armband zeigt dein Geburtsdatum in Binärform an.
pt_br: Você pode representar datas em binário! Sua pulseira mostra sua data de nascimento em formato binário.

source: You have several incorrect pixels. White spaces should remain white.
de: Du hast mehrere falsche Pixel. Weiße Stellen sollten weiß bleiben.
pt_br: Você tem vários pixels incorretos. Espaços brancos devem permanecer brancos.

source: You're missing several black pixels. Check the binary code carefully.
de: Dir fehlen mehrere schwarze Pixel. Überprüfe den Binärcode sorgfältig.
pt_br: Você está perdendo vários pixels pretos. Verifique o código binário com cuidado.

source: You're very close! Just a few more adjustments needed.
de: Du bist schon sehr nahe! Nur noch ein paar Anpassungen nötig.
pt_br: Você está muito perto! Só mais alguns ajustes necessários.

source: Your Age
de: Dein Alter
pt_br: Sua Idade

source: Your Answer
de: Deine Antwort
pt_br: Sua Resposta

source: Your Binary Armband
de: Dein Binäres Armband
pt_br: Sua Pulseira Binária

source: Your Color
de: Deine Farbe
pt_br: Sua Cor

source: Your Favorite Color
de: Deine Lieblingsfarbe
pt_br: Sua Cor Favorita

source: Your Name
de: Dein Name
pt_br: Seu Nome

source: Your number is too large by %lld. Try a smaller number.
de: Deine Zahl ist um %lld zu groß. Versuche eine kleinere Zahl.
pt_br: Seu número é muito grande por %lld. Tente um número menor.

source: Your number is too large by %lld. Try turning off some bits.
de: Deine Zahl ist um %lld zu groß. Versuche, einige Bits auszuschalten.
pt_br: Seu número é muito grande por %lld. Tente desligar alguns bits.

source: Your number is too small by %lld. Try a larger number.
de: Deine Zahl ist um %lld zu klein. Versuche eine größere Zahl.
pt_br: Seu número é muito pequeno por %lld. Tente um número maior.

source: Your number is too small by %lld. Try turning on some bits.
de: Deine Zahl ist um %lld zu klein. Versuche, einige Bits einzuschalten.
pt_br: Seu número é muito pequeno por %lld. Tente ligar alguns bits.
